import React, { useEffect, useState, useCallback } from "react";
import classnames from "classnames";
import { Spin } from "antd";

import Comment from "article/Comment";
import Header from "components/Header";
import RadiusBox from "components/RadiusBox";
import parser from "utils/parser";
import {
  articlesList,
  thumbsUpArticle,
  collectArticle,
  sendComment,
} from "../utils/client";

require("../asset/sass/editor.scss");

export default Article;

interface ArticleProps {
  title: string;
  content: string;
  footstep: number;
  created_at: string;
  nickname: string;
  thumbs_up: number;
  has_thumbs_up: boolean;
  star: number;
  has_star: boolean;
}

function Article() {
  const id = parser.params("id");

  const [article, setArticle] = useState<Partial<ArticleProps>>({});
  const [loading, setLoading] = useState(false);

  useEffect(() => {
    if (id) {
      setLoading(true);
      articlesList(id)
        .then(({ data = {} }) => {
          setArticle(data);
        })
        .finally(() => setLoading(false));
    }
  }, []);

  const commitComment = useCallback(
    (data: {
      comment?: string;
      article_id: number;
      pid?: number;
    }): Promise<any> => {
      return sendComment({
        ...data,
        article_id: id,
      });
    },
    [id]
  );

  /**
   * 给文章和评论点赞
   */
  const thumbsUp = useCallback(() => {
    if (id) {
      setArticle({
        ...article,
        thumbs_up: article.thumbs_up
          ? article.thumbs_up - 1
          : article.thumbs_up + 1,
        has_thumbs_up: !article.thumbs_up,
      });
      thumbsUpArticle(id).then(
        (
          { data, error }: { data: { [key: string]: any }; error: string[] } = {
            data: { thumbs_up: 0 },
            error: [],
          }
        ) => {
          if (error.length !== 0) {
            setArticle({
              ...article,
              thumbs_up: article.thumbs_up
                ? article.thumbs_up - 1
                : article.thumbs_up + 1,
              has_thumbs_up: !data.has_thumbs_up,
            });
          }
        }
      );
    }
  }, [article]);

  /**
   * 收藏文章
   */
  const collect = useCallback(() => {
    id &&
      collectArticle(id).then(
        (
          { data, error }: any = {
            data: { star: 0, has_star: false },
            error: [],
          }
        ) => {
          if (error.length === 0) {
            setArticle({
              ...article,
              star: data.star,
              has_star: data.has_star,
            });
          }
        }
      );
  }, [article]);

  return (
    <div className="article">
      <Header />

      <div className="text">
        <div className="standard-size">
          <div className="head">
            <div className="info">
              <div className="title">{article.title}</div>
              <div>{article.created_at}</div>
            </div>
            <div className="tips">
              <span>
                作者: @<a href="#">{article.nickname}</a>
              </span>
              <span>阅读: {article.footstep}</span>
              <span>收藏: {article.star}</span>
              <span>点赞: {article.thumbs_up}</span>
            </div>
          </div>
          {loading ? (
            <div className="content-loading">
              <Spin tip="加载中~" />
            </div>
          ) : (
            <div
              className="content"
              dangerouslySetInnerHTML={{ __html: article.content }}
            />
          )}

          <div onClick={thumbsUp} className="thumbs-up">
            <div
              className={classnames("kindness", {
                has_thumbs_up: article.has_thumbs_up,
              })}
            >
              <svg viewBox="0 0 1024 1024" className="kindness-icon">
                <path
                  fill={article.has_thumbs_up ? "#1296DB" : "#8A8A8A"}
                  d="M935.161672 137.608078C878.432647 79.097476 803.01498 46.860261 722.8021 46.860261c-75.470879 0-147.870816 28.883841-203.847711 81.401961l-6.977925 6.487761-6.978948-6.535857C449.019597 75.744101 376.642173 46.860261 301.17641 46.860261c-80.21288 0-155.61622 32.257681-212.359572 90.74884-57.047274 58.911738-88.469937 137.123031-88.469937 220.35978 0 83.259262 31.422663 161.470555 88.469937 220.407875l360.713388 372.063901c16.698311 17.207917 38.884612 26.699082 62.466704 26.699082 23.586185 0 45.77351-9.491165 62.47182-26.699082 0 0 356.737844-367.969653 360.691899-372.063901 57.068763-58.909691 88.491427-137.123031 88.491427-220.407875C1023.653099 274.753621 992.207923 196.540282 935.161672 137.608078L935.161672 137.608078zM903.296941 545.793664 542.583552 917.856541c-8.138354 8.443299-19.024286 13.095249-30.608112 13.095249-11.582803 0-22.442128-4.631484-30.608112-13.115716L120.680547 545.815153c-48.563042-50.095955-75.306126-116.773564-75.306126-187.824783 0-71.000054 26.743084-137.724735 75.306126-187.771571 48.279586-49.79715 112.443955-77.216639 180.702572-77.216639 64.094784 0 125.635395 24.629957 173.33579 69.306482l37.256532 34.930557 37.284161-34.930557c47.672766-44.698015 109.234867-69.306482 173.330674-69.306482 68.284199 0 132.448568 27.445072 180.707688 77.216639 48.563042 50.046836 75.306126 116.77254 75.306126 187.771571C978.603067 429.021124 951.859983 495.697709 903.296941 545.793664L903.296941 545.793664zM903.296941 545.793664M270.429129 186.400341l-2.490727 0.025583-0.041956 0.048095c-70.797439 1.36816-127.98286 59.394738-127.98286 130.469494 0 11.860119 9.650801 21.51092 21.509896 21.51092 11.860119 0 21.516036-9.650801 21.516036-21.532409 0-48.237631 39.258119-87.517239 87.512123-87.517239 11.865235 0 21.516036-9.650801 21.516036-21.516036C291.966655 196.029652 282.289248 186.400341 270.429129 186.400341L270.429129 186.400341zM270.429129 186.400341"
                ></path>
              </svg>
              <span className="tip">
                {article.has_thumbs_up ? "取消点赞" : "点个赞吧"}
              </span>
            </div>
          </div>

          <Comment articleId={id} commit={(data) => commitComment(data)} />
        </div>
      </div>

      <div className="tools-box">
        <RadiusBox
          onClick={thumbsUp}
          title={article.has_thumbs_up ? "取消点赞" : "点赞"}
          shadow
        >
          <svg viewBox="0 0 1024 1024" width="30" height="30">
            <path
              d="M82.4 407.1h210v515.1h-210z"
              fill="#FFFFFF"
              p-id="11774"
            ></path>
            <path
              d="M81 399h142.3v487.1H81z"
              fill={article.has_thumbs_up ? "#E87A66" : "#8A8A8A"}
              p-id="11775"
            ></path>
            <path
              d="M223.3 399h53.4v487.1h-53.4z"
              fill="#65D5EF"
              p-id="11776"
            ></path>
            <path
              d="M942.7 528.3l-61.1 307.6c-8 40.4-45.5 69.8-89.1 69.8H303.3c-6 0-10.9-4.6-10.9-10.3V451.9c0-5.6 4.8-10.2 10.8-10.2h10.1c50.5 0 97.3-16.4 131.9-46.1 35.7-30.7 55.4-73.4 55.4-120.2V131.9c0-2.2 1.9-4 4.2-4 80.1 0 145.2 61.4 145.2 137v162.3c0 8 6.9 14.5 15.4 14.5h201.2c23.1 0 44.9 9.6 59.6 26.4s20.7 38.8 16.5 60.2z"
              fill="#FFFFFF"
              p-id="11777"
            ></path>
            <path
              fill={article.has_thumbs_up ? "#F7DF8A" : "#8A8A8A"}
              d="M942.7 490.3l-61.1 307.6c-8 40.4-45.5 69.8-89.1 69.8H303.3c-6 0-10.9-4.6-10.9-10.3V413.9c0-5.6 4.8-10.2 10.8-10.2h10.1c50.5 0 97.3-16.4 131.9-46.1 35.7-30.7 55.4-73.4 55.4-120.2V94c0-2.2 1.9-4 4.2-4 80 0 145.2 61.4 145.2 137v162.3c0 8 6.9 14.5 15.4 14.5h201.2c23.1 0 44.9 9.6 59.6 26.4s20.7 38.7 16.5 60.1z"
              p-id="11778"
            ></path>
            <path
              d="M936.1 434.5c-19.8-23.8-48.8-37.5-79.8-37.5h-178V247c0-92.9-75.6-168.6-168.6-168.6-18.5 0-33.5 15-33.5 33.5v145.7c0 79.5-64.5 139.5-150 139.5h-9.7c-6 0-11.7 1.3-16.8 3.7-6.9-10.3-18.6-17.1-31.9-17.1H102.3C81.2 383.7 64 400.9 64 422v485.2c0 21.1 17.2 38.3 38.3 38.3H268c15 0 28-8.6 34.3-21.2 4.5 1.8 9.4 2.7 14.5 2.7h468.6c56 0 104-39.9 114.4-94.9l58.6-312.4c5.5-30.3-2.6-61.4-22.3-85.2zM276.8 907.3c0 4.9-4 8.9-8.9 8.9H102.3c-4.9 0-8.9-4-8.9-8.9V422c0-4.9 4-8.9 8.9-8.9h106.2V697c0 8.1 6.6 14.7 14.7 14.7S238 705.2 238 697V413.2h30c4.9 0 8.9 4 8.9 8.9v485.2z m652.5-392.9l-58.6 312.4c-7.7 41.1-43.6 70.9-85.4 70.9H316.7c-5.8 0-10.5-4.7-10.5-10.5V436.9c0-5.7 4.6-10.3 10.3-10.3h9.7c48.4 0 93.3-16.6 126.4-46.9 34.2-31.2 53-74.6 53-122.1V111.9c0-2.2 1.8-4 4-4 76.7 0 139.1 62.4 139.1 139.1v164.8c0 8.1 6.6 14.7 14.7 14.7h192.7c22.2 0 43 9.8 57.1 26.8 14.4 17.1 20.1 39.4 16.1 61.1z"
              fill="#274359"
              p-id="11779"
            ></path>
            <path
              d="M223.3 745.5c-8.1 0-14.7 6.7-14.7 15v32c0 8.3 6.6 15 14.7 15s14.7-6.7 14.7-15v-32c0-8.3-6.6-15-14.7-15z"
              fill="#274359"
            ></path>
          </svg>
        </RadiusBox>
        <RadiusBox
          onClick={() => collect()}
          title={article.has_thumbs_up ? "取消收藏" : "收藏"}
          shadow
        >
          <svg viewBox="0 0 1024 1024" width="30" height="30">
            <path
              d="M512 150.25664c7.1424 0 20.224 2.2272 27.59168 17.152l81.24416 164.61312a82.0224 82.0224 0 0 0 61.78816 44.91264l181.69344 26.40384c16.46592 2.39104 22.6304 14.14656 24.83712 20.9408 2.20672 6.79424 4.13184 19.92192-7.7824 31.5392l-131.48672 128.16384a82.03776 82.03776 0 0 0-23.58272 72.61184l31.03744 180.96128c1.6128 9.41568-0.54272 17.72032-6.40512 24.6784-6.08256 7.21408-15.01696 11.52-23.90016 11.52-4.83328 0-9.5232-1.2288-14.336-3.7632l-162.49856-85.43232a82.35008 82.35008 0 0 0-38.19008-9.43104c-13.25056 0-26.45504 3.26144-38.17984 9.42592L311.31648 869.9904c-4.75136 2.49856-9.5744 3.7632-14.336 3.7632-8.88832 0-17.8176-4.30592-23.90016-11.51488-5.8624-6.95808-8.01792-15.26272-6.40512-24.6784l31.03744-180.95104a82.03264 82.03264 0 0 0-23.59808-72.6272l-131.4816-128.16896c-11.91424-11.61728-9.99424-24.74496-7.7824-31.5392 2.20672-6.79424 8.36608-18.54464 24.83712-20.9408l181.69344-26.39872a81.9968 81.9968 0 0 0 61.7728-44.88192l81.25952-164.64384c7.36256-14.9248 20.44416-17.152 27.58656-17.152m0-71.79264c-36.57728 0-73.15968 19.05664-91.96544 57.16992L338.77504 300.27776a10.25536 10.25536 0 0 1-7.72096 5.61152L149.36064 332.288c-84.11648 12.22144-117.7088 115.59936-56.83712 174.92992l131.47648 128.15872c2.41664 2.3552 3.52256 5.74976 2.94912 9.07776l-31.03744 180.96128c-11.37152 66.29376 41.30304 120.12032 101.06368 120.12032 15.76448 0 32.04096-3.75296 47.744-12.0064l162.51392-85.43744a10.28096 10.28096 0 0 1 9.54368 0l162.51392 85.43744c15.70816 8.25856 31.96928 12.0064 47.744 12.0064 59.75552 0 112.43008-53.8368 101.06368-120.12032l-31.03744-180.96128a10.26048 10.26048 0 0 1 2.94912-9.07776l131.47648-128.15872c60.87168-59.33056 27.27936-162.70848-56.83712-174.92992l-181.69344-26.40384a10.25536 10.25536 0 0 1-7.72096-5.61152L603.97568 135.6288c-18.816-38.10816-55.3984-57.1648-91.97568-57.1648z"
              fill={article.has_star ? "#1296DB" : "#8A8A8A"}
            ></path>
          </svg>
        </RadiusBox>
      </div>
    </div>
  );
}
